# 03/13

## 变更
- 更改地图生成和拼凑机制，现在可以重复使用同一张地图模板，游戏会将每份都独立生成（模板之间暂时没有连接）
- 偏好设置的变更会被保存在Application.dataPath（游戏本地目录\_Data文件夹内），自动保存和读取
- 优化了游戏内更新机制，提高了更新效率。
    - 去掉了部分弱智代码和没有意义的UI更新，上版本耗时5秒的更新现在预计只消耗1秒
    - 降低了部分数据的更新频率
        - 角色记忆，体内物体，阵营道具栏的更新从每分钟1次降低到了每5分钟一次。
        - 非工作岗位无人互动时更新从每分钟1次降低到了每15分钟一次
        - 不与玩家在同一张地图（指没有楼层之间直连通道）的数据更新频率为每6分钟一次。包括以下数据：
            - 行动指令package更新
            - 角色AI寻找工作更新
    - 测试环境下，100个NPC原本耗时20秒的更新，现在预计消耗4秒。还有可优化的空间，但那得先等后续的机制做出来
- 玩家可以加入房间内其他NPC正在执行的家具使用指令（例如休息 娱乐 工作等）

## 已修复BUG
- NPC当前工作的描述会每分钟更新，避免出现已经在执行工作但文字描述不准确的情况
- 玩家单独和与其他NPC一同执行订单制造指令时可以制造出对应道具
- 开始调教行为现在会正确触发对象口上
- 休息指令现在不再被视为娱乐行为，NPC会在体力精力低于50%时（没有工作的话）优先休息
- NPC寻找娱乐行为时不会选择私人房间内的（不会出现NPC没工作的话呆在房间里永远不出来的情况）


# 02/10

## 变更
- 监禁系统变更：允许将复数NPC关押在同一家具内。被关押的NPC只能与同样被关押（且关押在同一家具内）的NPC互动
- 道具栏内道具满足条件的话会融合为单项，降低entry数量

## 已修复BUG
- 结束调教不再被判定为互动，不会有精力消耗
- 调教期间玩家的指令覆盖优先级有问题，无法自动替换，必须手动取消既有的冲突指令LOGS进行途中错误触发鼠标on hover的立绘更改不会在阵营管理->工作分配界面显示囚犯和访客的名字


# 02/06

## 变更
- 升级为了Unity6

## 已修复BUG
- 没有胃不需要进食的NPC依旧选择进食餐点，后因为找不到可供消化食物的器官导致CTD
- 单执行者，无目标对象的调教指令（自慰系）的结算有问题
- 更改了Spine素材加载方式，略微缓解了Aliasing和贴图缝隙


# 02/02

## 变更
- 优化了执行指令期间的LOGS显示方式。玩家，当前目标，和与玩家共同工作的角色的LOGS会贴左侧，与玩家工作无关NPC的LOGS会显示在右侧
- (DEBUG用)在战役选择界面，额外选项可以选debug版，添加了几个不会放在BA战役中的NPC来调试立绘，SPINE动画等
- 增加了基础服从度属性，会直接添加到角色的服从度上
- 当前指令有Master（命令者）的情况，指令执行者和接受者的指令接受判定从另外两方之间取高，态度判定两者取低
- 非调教状态下，允许同一队伍的成员互相执行指令时，未参与指令的队伍成员触发interrupt判定

## 已修复BUG
- 控制台不会记入重复的指令，且上箭头会从最新往最旧的指令倒回，下箭头相反。退出控制台后刷新UI
- 老师的立绘（？）初始位置偏了
- LOGS界面玩家点击推进LOG时没有自动将界面拉到最底下
- 部分NPC的指令判定显示在了错误的位置
- 基础服从度属性没有在UI中显示


# 02/01

### 多版本Spine动画兼容
- 目前支持的版本：4.0 4.1 4.2 （主要兼容对象为碧蓝档案和NIKKE）


# 01/31

### 口上系统改进
- 给大部分指令专用口上预留了位置（部分runtime创造的口上还没填内容，例如餐点指令，种菜指令，监禁指令等）
- 暂时移除了打招呼的口上条目，等找到更好的不会log spam的处理办法后再考虑将其加回来。（保留了每日一次的打招呼）
- 重新整理了logs中口上互动显示条件，现在NPC互相触发的口上内容（例如打招呼）只有当该NPC为玩家选择的目标时才会显示
- 重新整理了logs中口上的显示顺序，同一时间段内 同一角色触发的口上文会被塞到一起（并且追加鼠标悬浮效果）
- 重新分类了口上事件的触发机制

描述事件 "Descriptor"，被玩家看到时触发的一段（参照角色当前状态或行动改变内容的）描述。目前只在与玩家的‘见面事件’中触发

见面事件 "Greeting"，角色进入新的房间时会与新房间内所有角色互相触发的事件。也会在时停解除时触发。目前主要用途为打招呼，如目标为玩家的话额外触发描述事件和导入口上

干扰事件 "Interrupt"，在角色进入新房间时触发，检查房间内的所有行动。也会在角色所处房间内有人执行新行动时触发，检查这个新行动是否会影响/打断角色的当前行动。目前只实装了行动检测，没有实装该检测成立后的效果。

## BUG修复
- 修复了随行NPC的头像显示会因为移动房间而重复出现的bug（这个bug之后可能还会回来）

## 变更
- 降低了侍奉系指令的消耗，现在侍奉指令的目标对象不再会有精力消耗。

## 已知BUG
~~- 玩家执行持续时间超过1分钟的指令时，期间NPC的行动结算（房间移动，行动结束）显示过于混乱。等想到更好的解决办法后再来处理。~~


# 01/20

### 口上系统的初步实践
-每个指令的单独回应口上（这个结构已经有了懒得填内容）
-实装了角色见面的口上event，会在两个角色进入同一房间（或者时停解除）时触发，可以触发的内容目前包括：角色导入 每日初见 见面招呼 睡眠/时停中口上描述 休息/工作/性交途中口上描述

## BUG修复
- 修复了角色立绘没有立刻刷新的bug（现在会在脱衣服或调整立绘位置后立刻刷新且不会硬重置spine动画了）
- 修复了地图存储角色位置的两个registry内容不一致导致出现各种奇怪bug的问题（包括且不限于没能将游戏初始角色加入玩家阵营）

